return {
  "folke/snacks.nvim",
  opts = {
    dashboard = {
      preset = {
        header = [[
▀█████████▄     ▄████████    ▄█   ▄█▄    ▄████████ ▀████    ▐████▀ ▀████    ▐████▀   ▄▄▄▄███▄▄▄▄   
  ███    ███   ███    ███   ███ ▄███▀   ███    ███   ███▌   ████▀    ███▌   ████▀  ▄██▀▀▀███▀▀▀██▄ 
  ███    ███   ███    ███   ███▐██▀     ███    ███    ███  ▐███       ███  ▐███    ███   ███   ███ 
 ▄███▄▄▄██▀    ███    ███  ▄█████▀      ███    ███    ▀███▄███▀       ▀███▄███▀    ███   ███   ███ 
▀▀███▀▀▀██▄  ▀███████████ ▀▀█████▄    ▀███████████    ████▀██▄        ████▀██▄     ███   ███   ███ 
  ███    ██▄   ███    ███   ███▐██▄     ███    ███   ▐███  ▀███      ▐███  ▀███    ███   ███   ███ 
  ███    ███   ███    ███   ███ ▀███▄   ███    ███  ▄███     ███▄   ▄███     ███▄  ███   ███   ███ 
▄█████████▀    ███    █▀    ███   ▀█▀   ███    █▀  ████       ███▄ ████       ███▄  ▀█   ███   █▀  
                            ▀                                                                      ]],
      },
      sections = {
        { section = "header" },
        { section = "keys", gap = 1, padding = 1 },
      },
    },
    image = {},
    terminal = {
      win = {
        relative = "editor",
        position = "float",
        width = 0.9,
        height = 0.85,
        border = "rounded",
        backdrop = 60,
      },
    },
  },
  scroll = {
    enabled = true, -- 开启平滑滚动
  },
  statuscolumn = {
    enabled = true, -- 开启增强状态列
    -- 如果需要自定义组件顺序，可以添加：
    -- left = { "mark", "sign" },
    -- right = { "fold", "git" },
  },
}
